tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_trdc.c
/*
 * Copyright 2021-2023,2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_trdc.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.trdc"
#endif

/* The memory increment definition in byte of MBC and MRC configuration registers */
#define TRDC_MRC_DOMAIN_INCREMENT 0x100UL
#define TRDC_MBC_DOMAIN_INCREMENT 0x200UL
/* In latest TRDC register definition this macro has been removed from device header file. Add this for backward
 * compatability. */
#ifndef TRDC_MBC_NSE_BLK_CLR_ALL_DID_SEL
#define TRDC_MBC_NSE_BLK_CLR_ALL_DID_SEL(x) ((uint32_t)(((uint32_t)(x)) << TRDC_MBC_NSE_BLK_CLR_ALL_DID_SEL0_SHIFT))
#endif

typedef union
{
    trdc_processor_domain_assignment_t _processor_domain_assignment;
    trdc_non_processor_domain_assignment_t _non_processor_domain_assignment;
    trdc_idau_config_t _idau_config;
    trdc_memory_access_control_config_t _memory_access_control;
    trdc_mbc_memory_block_config_t _mbc_memory_blk;
    trdc_mbc_nse_update_config_t _mbc_nse_update;
#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
    trdc_pid_config_t _pid_config;
#endif
    uint32_t _u32;
} trdc_reg32_convert_t;

/*******************************************************************************
 * Variables
 ******************************************************************************/
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

static const uint32_t trdc_mbc_slave_increments[3U] = {0x140UL, 0x28UL, 0x28UL};

/*******************************************************************************
 * Code
 ******************************************************************************/
/*!
 * brief Gets the TRDC hardware configuration.
 *
 * This function gets the TRDC hardware configurations, including number of bus
 * masters, number of domains, number of MRCs and number of PACs.
 *
 * param base TRDC peripheral base address.
 * param config Pointer to the structure to get the configuration.
 */
void TRDC_GetHardwareConfig(TRDC_Type *base, trdc_hardware_config_t *config)
{
    assert(NULL != config);

    config->masterNumber = (uint8_t)((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NMSTR_MASK) >> TRDC_TRDC_HWCFG0_NMSTR_SHIFT);
    config->domainNumber = (uint8_t)((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NDID_MASK) >> TRDC_TRDC_HWCFG0_NDID_SHIFT);
    config->mbcNumber    = (uint8_t)((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NMBC_MASK) >> TRDC_TRDC_HWCFG0_NMBC_SHIFT);
    config->mrcNumber    = (uint8_t)((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NMRC_MASK) >> TRDC_TRDC_HWCFG0_NMRC_SHIFT);
}

/*!
 * brief Gets the hardware configuration of the one of two slave memories within each MBC(memory block checker).
 *
 * param base TRDC peripheral base address.
 * param config Pointer to the structure to get the configuration.
 * param mbcIdx MBC number.
 * param slvIdx Slave number.
 */
void TRDC_GetMbcHardwareConfig(TRDC_Type *base,
                               trdc_slave_memory_hardware_config_t *config,
                               uint8_t mbcIdx,
                               uint8_t slvIdx)
{
    assert(NULL != config);
    assert(mbcIdx < (uint8_t)((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NMBC_MASK) >> TRDC_TRDC_HWCFG0_NMBC_SHIFT));
    assert(slvIdx < 4U);

    config->blockNum  = base->MBC_INDEX[mbcIdx].MBC_MEM_GLBCFG[slvIdx] & TRDC_MBC_MEM_GLBCFG_NBLKS_MASK;
    config->blockSize = (base->MBC_INDEX[mbcIdx].MBC_MEM_GLBCFG[slvIdx] & TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_MASK) >>
                        TRDC_MBC_MEM_GLBCFG_SIZE_LOG2_SHIFT;
}

/*!
 * brief Gets the default master domain assignment for the processor bus master.
 *
 * This function gets the default master domain assignment for the processor bus master.
 * It should only be used for the processor bus masters, such as CORE0. This function
 * sets the assignment as follows:
 *
 * code
 * assignment->domainId           = 0U;
 * assignment->domainIdSelect     = kTRDC_DidMda;
 * assignment->lock               = 0U;
 * endcode
 *
 * param domainAssignment Pointer to the assignment structure.
 */
void TRDC_GetDefaultProcessorDomainAssignment(trdc_processor_domain_assignment_t *domainAssignment)
{
    assert(NULL != domainAssignment);

    /* Initializes the configure structure to zero. */
    (void)memset(domainAssignment, 0, sizeof(*domainAssignment));
}

/*!
 * brief Gets the default master domain assignment for non-processor bus master.
 *
 * This function gets the default master domain assignment for non-processor bus master.
 * It should only be used for the non-processor bus masters, such as DMA. This function
 * sets the assignment as follows:
 *
 * code
 * assignment->domainId            = 0U;
 * assignment->privilegeAttr       = kTRDC_ForceUser;
 * assignment->secureAttr       = kTRDC_ForceSecure;
 * assignment->bypassDomainId      = 0U;
 * assignment->lock                = 0U;
 * endcode
 *
 * param domainAssignment Pointer to the assignment structure.
 */
void TRDC_GetDefaultNonProcessorDomainAssignment(trdc_non_processor_domain_assignment_t *domainAssignment)
{
    assert(NULL != domainAssignment);

    /* Initializes the configure structure to zero. */
    (void)memset(domainAssignment, 0, sizeof(*domainAssignment));
}

#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
/*!
 * brief Sets the processor bus master domain assignment.
 *
 * This function sets the processor master domain assignment as valid.
 * One bus master might have multiple domain assignment registers. The parameter
 * \p assignIndex specifies which assignment register to set.
 *
 * Example: Set domain assignment for core 0.
 *
 * code
 * trdc_processor_domain_assignment_t processorAssignment;
 *
 * TRDC_GetDefaultProcessorDomainAssignment(&processorAssignment);
 *
 * processorAssignment.domainId = 0;
 * processorAssignment.xxx      = xxx;
 * TRDC_SetMasterDomainAssignment(TRDC, 1, &processorAssignment);
 * endcode
 *
 * param base TRDC peripheral base address.
 * param master Which master to configure, refer to trdcx_master_t in processor header file, x is trdc instance.
 * param regNum Which register to configure, processor master can have more than one register for the MDAC
 * configuration. param domainAssignment Pointer to the assignment structure.
 */
void TRDC_SetProcessorDomainAssignment(TRDC_Type *base,
                                       uint8_t master,
                                       uint8_t regNum,
                                       const trdc_processor_domain_assignment_t *domainAssignment)
#else
/*!
 * brief Sets the processor bus master domain assignment.
 *
 * This function sets the processor master domain assignment as valid.
 * One bus master might have multiple domain assignment registers. The parameter
 * \p assignIndex specifies which assignment register to set.
 *
 * Example: Set domain assignment for core 0.
 *
 * code
 * trdc_processor_domain_assignment_t processorAssignment;
 *
 * TRDC_GetDefaultProcessorDomainAssignment(&processorAssignment);
 *
 * processorAssignment.domainId = 0;
 * processorAssignment.xxx      = xxx;
 * TRDC_SetMasterDomainAssignment(TRDC, &processorAssignment);
 * endcode
 *
 * param base TRDC peripheral base address.
 * param domainAssignment Pointer to the assignment structure.
 */
void TRDC_SetProcessorDomainAssignment(TRDC_Type *base, const trdc_processor_domain_assignment_t *domainAssignment)
#endif
{
#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
    /* Make sure the master number does not exceed the max master count. */
    assert(master < ((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NMSTR_MASK) >> TRDC_TRDC_HWCFG0_NMSTR_SHIFT));
    /* Make sure the master is a processor master. */
    assert(0U == (base->DACFG[master] & TRDC_DACFG_NCM_MASK));
#endif
    assert(NULL != domainAssignment);
    assert(domainAssignment->domainId <
           ((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NDID_MASK) >> TRDC_TRDC_HWCFG0_NDID_SHIFT));

    trdc_reg32_convert_t pid;
    pid._processor_domain_assignment = *domainAssignment;

#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
    base->MDA_DFMT0[master].MDA_W_DFMT0[regNum] = pid._u32 | TRDC_MDA_W_DFMT0_VLD_MASK;
#else
    base->MDA_W0_0_DFMT0 = pid._u32 | TRDC_MDA_W0_0_DFMT0_VLD_MASK;
#endif
}

/*!
 * brief Sets the non-processor bus master domain assignment.
 *
 * This function sets the non-processor master domain assignment as valid.
 * One bus master might have multiple domain assignment registers. The parameter
 * \p assignIndex specifies which assignment register to set.
 *
 * Example: Set domain assignment for DMA0.
 * code
 * trdc_non_processor_domain_assignment_t nonProcessorAssignment;
 *
 * TRDC_GetDefaultNonProcessorDomainAssignment(&nonProcessorAssignment);
 * nonProcessorAssignment.domainId = 1;
 * nonProcessorAssignment.xxx      = xxx;
 *
 * TRDC_SetMasterDomainAssignment(TRDC, kTrdcMasterDma0, 0U, &nonProcessorAssignment);
 * endcode
 *
 * param base TRDC peripheral base address.
 * param master Which master to configure, refer to trdc_master_t in processor header file.
 * param domainAssignment Pointer to the assignment structure.
 */
void TRDC_SetNonProcessorDomainAssignment(TRDC_Type *base,
                                          uint8_t master,
                                          const trdc_non_processor_domain_assignment_t *domainAssignment)
{
    assert(master < ((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NMSTR_MASK) >> TRDC_TRDC_HWCFG0_NMSTR_SHIFT));
    /* Make sure the master is a non-CPU/non-processor master */
    assert(0U != (base->DACFG[master] & TRDC_DACFG_NCM_MASK));
    assert(NULL != domainAssignment);
    assert(domainAssignment->domainId <
           ((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NDID_MASK) >> TRDC_TRDC_HWCFG0_NDID_SHIFT));

    trdc_reg32_convert_t pid;
    pid._non_processor_domain_assignment = *domainAssignment;

#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
    base->MDA_DFMT1[master].MDA_W_DFMT1[0] = pid._u32 | TRDC_MDA_W_DFMT1_VLD_MASK;
#else
    assert(master != 0U);
    base->MDA_W0_DFMT1[master - 1U].MDA_W0_x_DFMT1 = pid._u32 | TRDC_MDA_W0_x_DFMT1_VLD_MASK;
#endif
}

#if defined(FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT) && (FSL_FEATURE_TRDC_PROCESSOR_MASTER_COUNT > 1)
/*!
 * brief Sets the current Process identifier(PID) for processor core.
 *
 * Each processor has a corresponding process identifier (PID) which can be used to group tasks into different domains.
 * Secure privileged software saves and restores the PID as part of any context switch.
 *
 * param base TRDC peripheral base address.
 * param master Which processor master to configure, refer to trdc_master_t in processor header file.
 * param pidConfig Pointer to the configuration structure.
 */
void TRDC_SetPid(TRDC_Type *base, uint8_t master, const trdc_pid_config_t *pidConfig)
{
    assert(pidConfig != NULL);
    assert(master < (sizeof(base->PID) / 4U));
    assert(FSL_FEATURE_TRDC_INSTANCE_HAS_PID_CONFIGURATIONn(base) != 0);

    trdc_reg32_convert_t pid;
    pid._pid_config   = *pidConfig;
    base->PID[master] = pid._u32;
}
#endif

/*!
 * brief Gets the default IDAU(Implementation-Defined Attribution Unit) configuration.
 *
 * code
 * config->lockSecureVTOR    = false;
 * config->lockNonsecureVTOR = false;
 * config->lockSecureMPU     = false;
 * config->lockNonsecureMPU  = false;
 * config->lockSAU           = false;
 * endcode
 *
 * param domainAssignment Pointer to the configuration structure.
 */
void TRDC_GetDefaultIDAUConfig(trdc_idau_config_t *idauConfiguration)
{
    assert(NULL != idauConfiguration);

    /* Initializes the configure structure to zero. */
    (void)memset(idauConfiguration, 0, sizeof(*idauConfiguration));
}

/*!
 * brief Sets the IDAU(Implementation-Defined Attribution Unit) control configuration.
 *
 * Example: Lock the secure and non-secure MPU registers.
 *
 * code
 * trdc_idau_config_t idauConfiguration;
 *
 * TRDC_GetDefaultIDAUConfig(&idauConfiguration);
 *
 * idauConfiguration.lockSecureMPU = true;
 * idauConfiguration.lockNonsecureMPU      = true;
 * TRDC_SetIDAU(TRDC, &idauConfiguration);
 * endcode
 *
 * param base TRDC peripheral base address.
 * param domainAssignment Pointer to the configuration structure.
 */
void TRDC_SetIDAU(TRDC_Type *base, const trdc_idau_config_t *idauConfiguration)
{
    assert(NULL != idauConfiguration);

    trdc_reg32_convert_t pid;
    pid._idau_config = *idauConfiguration;

    base->TRDC_IDAU_CR = pid._u32 | TRDC_TRDC_IDAU_CR_VLD_MASK;
}

/*!
 * brief Gets the default FLW(Flsh Logical Window) configuration.
 *
 * code
 * config->blockCount    = false;
 * config->arrayBaseAddr = false;
 * config->lock     = false;
 * config->enable  = false;
 * endcode
 *
 * param flwConfiguration Pointer to the configuration structure.
 */
void TRDC_GetDefaultFlashLogicalWindowConfig(trdc_flw_config_t *flwConfiguration)
{
    assert(NULL != flwConfiguration);

    /* Initializes the configure structure to zero. */
    (void)memset(flwConfiguration, 0, sizeof(*flwConfiguration));

    flwConfiguration->enable = 0x1UL;
}

/*!
 * brief Sets the FLW function's configuration.
 *
 * code
 * trdc_flw_config_t flwConfiguration;
 *
 * TRDC_GetDefaultIDAUConfig(&flwConfiguration);
 *
 * flwConfiguration.blockCount = 32U;
 * flwConfiguration.arrayBaseAddr = 0xXXXXXXXX;
 * TRDC_SetIDAU(TRDC, &flwConfiguration);
 * endcode
 *
 * param base TRDC peripheral base address.
 * param flwConfiguration Pointer to the configuration structure.
 */
void TRDC_SetFlashLogicalWindow(TRDC_Type *base, const trdc_flw_config_t *flwConfiguration)
{
    assert(NULL != flwConfiguration);
    assert((base->TRDC_FLW_CTL & TRDC_TRDC_FLW_CTL_LK_MASK) == 0U);

    base->TRDC_FLW_ABASE = flwConfiguration->arrayBaseAddr;
    base->TRDC_FLW_BCNT  = flwConfiguration->blockCount;
    base->TRDC_FLW_CTL   = TRDC_TRDC_FLW_CTL_V(flwConfiguration->enable ? 1U : 0U) |
                            TRDC_TRDC_FLW_CTL_LK(flwConfiguration->lock ? 1U : 0U);
}

