tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_trdc.c
    return status;
}

/*!
 * brief Sets the memory access configuration for one of the access control register of one MRC.
 *
 * Example: Enable the secure operations and lock the configuration for MRC0 region 1.
 *
 * code
 * trdc_memory_access_control_config_t config;
 *
 * config.securePrivX = true;
 * config.securePrivW = true;
 * config.securePrivR = true;
 * config.lock = true;
 * TRDC_SetMrcMemoryAccess(TRDC, &config, 0, 1);
 * endcode
 *
 * param base TRDC peripheral base address.
 * param config Pointer to the configuration structure.
 * param mrcIdx MRC index.
 * param regIdx Register number.
 */
void TRDC_MrcSetMemoryAccessConfig(TRDC_Type *base,
                                   const trdc_memory_access_control_config_t *config,
                                   uint8_t mrcIdx,
                                   uint8_t regIdx)
{
    assert(NULL != base);
    assert(NULL != config);
    assert(regIdx < 8U);
    /* Check if this access config register has already been locked. */
    assert((base->MRC_INDEX[mrcIdx].MRC_GLBAC[regIdx] & TRDC_MRC_GLBAC_LK_MASK) == 0U);

    trdc_reg32_convert_t pid;

    pid._memory_access_control                = *config;
    base->MRC_INDEX[mrcIdx].MRC_GLBAC[regIdx] = pid._u32;
}

/*!
 * brief Enables the update of the selected domains.
 *
 * After the domains' update are enabled, their regions' NSE bits can be set or clear.
 *
 * param base TRDC peripheral base address.
 * param mrcIdx MRC index.
 * param domainMask Bit mask of the domains to be enabled.
 * param enable True to enable, false to disable.
 */
void TRDC_MrcEnableDomainNseUpdate(TRDC_Type *base, uint8_t mrcIdx, uint16_t domainMask, bool enable)
{
    assert(NULL != base);

    if (enable)
    {
        base->MRC_INDEX[mrcIdx].MRC_NSE_RGN_INDIRECT |= ((uint32_t)domainMask << 16U);
    }
    else
    {
        base->MRC_INDEX[mrcIdx].MRC_NSE_RGN_INDIRECT &= ~((uint32_t)domainMask << 16U);
    }
}

/*!
 * brief Sets the NSE bits of the selected regions for domains.
 *
 * This function sets the NSE bits for the selected regions for the domains whose update are enabled.
 *
 * param base TRDC peripheral base address.
 * param mrcIdx MRC index.
 * param regionMask Bit mask of the regions whose NSE bits to set.
 */
void TRDC_MrcRegionNseSet(TRDC_Type *base, uint8_t mrcIdx, uint16_t regionMask)
{
    assert(NULL != base);

    base->MRC_INDEX[mrcIdx].MRC_NSE_RGN_SET = ((uint32_t)regionMask);
}

/*!
 * brief Clears the NSE bits of the selected regions for domains.
 *
 * This function clears the NSE bits for the selected regions for the domains whose update are enabled.
 *
 * param base TRDC peripheral base address.
 * param mrcIdx MRC index.
 * param regionMask Bit mask of the regions whose NSE bits to clear.
 */
void TRDC_MrcRegionNseClear(TRDC_Type *base, uint8_t mrcIdx, uint16_t regionMask)
{
    assert(NULL != base);

    base->MRC_INDEX[mrcIdx].MRC_NSE_RGN_CLR = ((uint32_t)regionMask);
}

/*!
 * brief Clears the NSE bits for all the regions of the selected domains.
 *
 * This function clears the NSE bits for all regions of selected domains whose update are enabled.
 *
 * param base TRDC peripheral base address.
 * param mrcIdx MRC index.
 * param domainMask Bit mask of the domains whose NSE bits to clear.
 */
void TRDC_MrcDomainNseClear(TRDC_Type *base, uint8_t mrcIdx, uint16_t domainMask)
{
    assert(NULL != base);

    uint8_t domainCount  = (uint8_t)((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NDID_MASK) >> TRDC_TRDC_HWCFG0_NDID_SHIFT);
    uint8_t maxDomainId = 0U;
    uint16_t tmpDomainMask = domainMask;

    while (tmpDomainMask != 0U)
    {
        tmpDomainMask >>= 1U;
        maxDomainId++;
    }

    /* Check whether the domain mask contains invalid domain. */
    if (maxDomainId > domainCount)
    {
        assert(false);
    }

    base->MRC_INDEX[mrcIdx].MRC_NSE_RGN_CLR_ALL = ((uint32_t)domainMask << 16U);
}

/*!
 * brief Sets the configuration for one of the region descriptor per domain per MRC instnce.
 *
 * This function sets the configuration for one of the region descriptor, including the start
 * and end address of the region, memory access control policy and valid.
 *
 * param base TRDC peripheral base address.
 * param config Pointer to region descriptor configuration structure.
 */
void TRDC_MrcSetRegionDescriptorConfig(TRDC_Type *base, const trdc_mrc_region_descriptor_config_t *config)
{
    assert(NULL != base);

    uint32_t regAddr = (uint32_t) & (base->MRC_INDEX[config->mrcIdx].MRC_DOM0_RGD_W[config->regionIdx][0]);

    regAddr += TRDC_MRC_DOMAIN_INCREMENT * config->domainIdx;

    /* Set configuration for word 0 */
    uint32_t data = TRDC_MRC_DOM0_RGD_W_MRACSEL(config->memoryAccessControlSelect) |
                    (config->startAddr & TRDC_MRC_DOM0_RGD_W_STRT_ADDR_MASK);
    *(uint32_t *)regAddr = data;

    /* Check whether the register is set according to configuration. */
    assert(*(uint32_t *)regAddr == data);

    /* Set configuration for word 1 */
    regAddr += 4U;
    data = TRDC_MRC_DOM0_RGD_W_VLD(config->valid ? 1U : 0U) | TRDC_MRC_DOM0_RGD_W_NSE(config->nseEnable ? 1U : 0U) |
           (config->endAddr & TRDC_MRC_DOM0_RGD_W_END_ADDR_MASK);
    *(uint32_t *)regAddr = data;

    /* Check whether the register is set according to configuration. */
    assert(*(uint32_t *)regAddr == data);
}

/*!
 * brief Sets the NSR update configuration for one of the MBC instance.
 *
 * After set the NSE configuration, the configured memory area can be updateby NSE set/clear.
 *
 * param base TRDC peripheral base address.
 * param config Pointer to NSE update configuration structure.
 * param mbcIdx MBC index.
 */
void TRDC_MbcSetNseUpdateConfig(TRDC_Type *base, const trdc_mbc_nse_update_config_t *config, uint8_t mbcIdx)
{
    assert(base != NULL);

    trdc_reg32_convert_t pid;

    pid._mbc_nse_update                       = *config;
    base->MBC_INDEX[mbcIdx].MBC_NSE_BLK_INDEX = pid._u32;
}

/*!
 * brief Sets the NSE bits of the selected configuration words according to NSE update configuration.
 *
 * This function sets the NSE bits of the word for the configured regio, memory.
 *
 * param base TRDC peripheral base address.
 * param mbcIdx MBC index.
 * param bitMask Mask of the bits whose NSE bits to set.
 */
void TRDC_MbcWordNseSet(TRDC_Type *base, uint8_t mbcIdx, uint32_t bitMask)
{
    assert(NULL != base);

