tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_trdc.c
    base->MBC_INDEX[mbcIdx].MBC_NSE_BLK_SET = ((uint32_t)bitMask);
}

/*!
 * brief Clears the NSE bits of the selected configuration words according to NSE update configuration.
 *
 * This function sets the NSE bits of the word for the configured regio, memory.
 *
 * param base TRDC peripheral base address.
 * param mbcIdx MBC index.
 * param bitMask Mask of the bits whose NSE bits to clear.
 */
void TRDC_MbcWordNseClear(TRDC_Type *base, uint8_t mbcIdx, uint32_t bitMask)
{
    assert(NULL != base);

    base->MBC_INDEX[mbcIdx].MBC_NSE_BLK_CLR = ((uint32_t)bitMask);
}

/*!
 * brief Clears all configuration words' NSE bits of the selected domain and memory.
 *
 * param base TRDC peripheral base address.
 * param mbcIdx MBC index.
 * param domainMask Mask of the domains whose NSE bits to clear, 0b110 means clear domain 1&2.
 * param slaveMask Mask of the slaves whose NSE bits to clear, 0x11 means clear all slave 0&1's NSE bits.
 */
void TRDC_MbcNseClearAll(TRDC_Type *base, uint8_t mbcIdx, uint16_t domainMask, uint8_t slaveMask)
{
    assert(NULL != base);

    uint8_t dmainCount  = (uint8_t)((base->TRDC_HWCFG0 & TRDC_TRDC_HWCFG0_NDID_MASK) >> TRDC_TRDC_HWCFG0_NDID_SHIFT);
    uint8_t maxDomainId = 0U;
    uint16_t tmpDomainMask = domainMask;

    while (tmpDomainMask != 0U)
    {
        tmpDomainMask >>= 1U;
        maxDomainId++;
    }

    if (maxDomainId > dmainCount)
    {
        assert(false);
    }

    base->MBC_INDEX[mbcIdx].MBC_NSE_BLK_CLR_ALL =
        TRDC_MBC_NSE_BLK_CLR_ALL_DID_SEL(domainMask) | TRDC_MBC_NSE_BLK_CLR_ALL_MEMSEL(slaveMask);
}

/*!
 * brief Sets the memory access configuration for one of the region descriptor of one MBC.
 *
 * Example: Enable the secure operations and lock the configuration for MRC0 region 1.
 *
 * code
 * trdc_memory_access_control_config_t config;
 *
 * config.securePrivX = true;
 * config.securePrivW = true;
 * config.securePrivR = true;
 * config.lock = true;
 * TRDC_SetMbcMemoryAccess(TRDC, &config, 0, 1);
 * endcode
 *
 * param base TRDC peripheral base address.
 * param config Pointer to the configuration structure.
 * param mbcIdx MBC index.
 * param rgdIdx Region descriptor number.
 */
void TRDC_MbcSetMemoryAccessConfig(TRDC_Type *base,
                                   const trdc_memory_access_control_config_t *config,
                                   uint8_t mbcIdx,
                                   uint8_t rgdIdx)
{
    assert(NULL != base);
    assert(NULL != config);
    assert(rgdIdx < 8U);
    /* Check if this access config register has already been locked. */
    assert((base->MBC_INDEX[mbcIdx].MBC_MEMN_GLBAC[rgdIdx] & TRDC_MBC_MEMN_GLBAC_LK_MASK) == 0U);

    trdc_reg32_convert_t pid;

    pid._memory_access_control                     = *config;
    base->MBC_INDEX[mbcIdx].MBC_MEMN_GLBAC[rgdIdx] = pid._u32;
}

/*!
 * brief Sets the configuration for one of the memory block per domain per MBC instnce.
 *
 * This function sets the configuration for one of the memory block, including the memory access
 * control policy and nse enable.
 *
 * param base TRDC peripheral base address.
 * param config Pointer to memory block configuration structure.
 */
void TRDC_MbcSetMemoryBlockConfig(TRDC_Type *base, const trdc_mbc_memory_block_config_t *config)
{
    assert(NULL != base);

    uint32_t shift          = 4UL * (config->memoryBlockIdx % 8UL);
    uint32_t regAddr        = (uint32_t) & (base->MBC_INDEX[config->mbcIdx].MBC_DOM0_MEM0_BLK_CFG_W[0]);
    uint32_t slaveIncrement = 0U;
    uint32_t configWord     = 0U;
    trdc_reg32_convert_t pid;

    pid._mbc_memory_blk = *config;
    configWord          = (pid._u32 & 0xFU) << shift;

    for (uint8_t i = 0; i < config->slaveMemoryIdx; i++)
    {
        slaveIncrement += trdc_mbc_slave_increments[i];
    }

    regAddr += (TRDC_MBC_DOMAIN_INCREMENT * config->domainIdx + slaveIncrement) +
               ((uint32_t)config->memoryBlockIdx / 8U) * sizeof(uint32_t);
    configWord           = configWord | (*(uint32_t *)regAddr & ~(0xFUL << shift));
    *(uint32_t *)regAddr = configWord;

    /* Check whether the register is set according to configuration. */
    assert((*(uint32_t *)regAddr & (0xFUL << shift)) == ((pid._u32 & 0xFU) << shift));
}
